Repository: Megaco/adbtools2
Catalog: locale/*/LC_MESSAGES/adbtools2.po
Languages: it

source: Usage: confbin2xml.py [ -l it|en ] <key4conf> <key4cpe> <conf_bin> <conf_xml> <confcpe_xml>
it: Uso: confbin2xml.py [ -l it|en ] <key4conf> <key4cpe> <conf_bin> <conf_xml> <confcpe_xml>

source: Text file
it: File di testo

source: All Files
it: Tutti i file

source: Restricted Text File
it: File testo restrizioni

source: Error writing:
it: Errore scrittura:

source: Unlocked restricted web pages
it: Pagine web con restrizioni sbloccate

source: Unlocked restricted commands in CLI
it: Comandi CLI con restrizioni sbloccati

source: Unlocked
it: Sbloccato

source: Locked
it: Bloccato

source: Fixed
it: Corretto

source: Not Fixed
it: Non corretto

source: check_enable_menu - done
it: check_enable_menu - completato

source: load_pems - error opening
it: load_pems - errore apertura

source: Severe Error
it: Errore grave

source: A severe error occoured in 'load_pems'. File missing:
it: Si è verificato un errore grave in 'load_pems'. File mancante:

source: load_pems - done
it: load_pems - completato

source: len 1:
it: lunghezza 1:

source: len 2:
it: lunghezza 2:

source: ADB Configuration Editor (confedit) Copyright (c) 2018 Valerio Di Giampietro (main program) Copyright (c) 2017 Gabriel Huber (decrypting algorithm) Copyright (c) 2017 Benjamin Bertrand (windows interface) License informations available in the LICENSE file THE SOFTWARE IS PROVIDED 'AS IS', WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
it: ADB Configuration Editor (confedit) Copyright (c) 2018 Valerio Di Giampietro (programma principale) Copyright (c) 2017 Gabriel Huber (algoritmo decriptazione) Copyright (c) 2017 Benjamin Bertrand (interfaccia Windows) Informazioni licenza disponibili nel file LICENSE IL SOFTWARE VIENE FORNITO 'COSÌ COM'È', SENZA ALCUNA GARANZIA DI ALCUN TIPO, ESPLICITA O IMPLICITA, INCLUSO, IN VIA ESEMPLIFICATIVA, LE GARANZIE DI COMMERCIABILITÀ, IDONEITÀ PER UN PARTICOLARE SCOPO E NON VIOLAZIONE. IN NESSUN CASO GLI AUTORI O DETENTORI DEL COPYRIGHT SARANNO RESPONSABILI PER QUALSIASI RECLAMO, DANNO O ALTRA RESPONSABILITÀ, ANCHE IN UN'AZIONE DI CONTRATTO, TORTO O ALTRIMENTI, DERIVANTI DA, A PARTE O IN CONNESSIONE CON IL SOFTWARE O L'USO O ALTRE DISPOSIZIONI DEL SOFTWARE.

source: about - reading
it: about - lettura

source: About
it: Info sul programma

source: Program version:
it: Versione programma:

source: enable_fw_upgrade - firmware upgrade/downgrade enabled
it: enable_fw_upgrade - upgrade/downgrade firmware abilitato

source: Configuration File
it: File configurazione

source: Binary Configuration File
it: File binario configurazione

source: load_config - loading
it: load_config - caricamento

source: load_config - no file selected
it: load_config - nessun file selezionato

source: load_config - error opening
it: load_config - errore apertura

source: len data_in:
it: lungehzza dati ingresso:

source: load_config - error in decrypting data
it: load_config - errore nella decriptazione dati

source: Wrong input file?
it: File sorgente errato?

source: Error in input file
it: Errore nel file sorgente

source: Error in decrypting data
it: Errore nella decriptazione dati

source: load_config - error in finding hex data
it: load_config - errore nella ricerca dati esadecimali

source: A severe error occurred in 'load_config'. Unable to extract CPE XML configuration.
it: Si è verificato un errore grave in 'load_config'. Impossibile estrarre la configurazione XML CPE.

source: load_config - length cpedata_out
it: load_config - lunghezza cpedata_out

source: XML Configuration File
it: File configurazione XML

source: load_xmlconfig - loading
it: load_xmlconfig - caricamento

source: load_xmlconfig - no file selected
it: load_xmlconfig - nessun file selezionato

source: load_xmlconfig - error opening
it: load_xmlconfig - errore apertura

source: CPE XML Configuration File
it: File configurazione XML CPE

source: load_cpexmlconfig - loading
it: load_cpexmlconfig - caricamento

source: load_cpexmlconfig - no file selected
it: load_cpexmlconfig - nessun file selezionato

source: load_cpexmlconfig - error opening
it: load_cpexmlconfig - errore apertura

source: save_config - saving
it: save_config - salvataggio

source: save_config - no file selected
it: save_config - nessun file selezionato

source: save_config - error opening
it: save_config - errore apertura

source: XML configuration file
it: File XML configurazione

source: Save XML Configuration File
it: Salva fiel configurazione XML

source: save_xmlconfig - saving
it: save_xmlconfig - salvataggio

source: save_xmlconfig - no file selected
it: save_xmlconfig - nessun file selezionato

source: Save CPE XML Configuration File
it: Salva file configurazione XML CPE

source: save_cpexmlconfig - saving
it: save_cpexmlconfig - salvataggio

source: save_cpexmlconfig - no file selected
it: save_cpexmlconfig - nessun file selezionato

source: save_cpexmlconfig - error opening
it: save_cpexmlconfig - errore apertura

source: Exit with error
it: Uscita con errore

source: not implemented yet
it: non ancora implementato

source: Not implemented yet
it: Non ancora implementato

source: Level:
it: Livello:

source: Message:
it: Messaggio:

source: Submit
it: Invia

source: Hardware Version:
it: Versione hardware:

source: Manufacturer:
it: Produttore:

source: Model Name:
it: Nome modello:

source: Router customer ID:
it: ID utente router:

source: Serial Number:
it: Numero seriale:

source: Router IP (bridge interface):
it: IP router (interfaccia bridge):

source: Router Net Mask (bridge interface):
it: Net mask router (interfaccia bridge):

source: BSD GUI visible:
it: GUI BSD visibile:

source: Restricted web GUI:
it: GUI web con restrizioni:

source: Restricted CLI commands:
it: Comandi CLI limitati:

source: Firmware upgrade enabled:
it: Aggiornamento firmware abilitato:

source: Firmware downgrade enabled:
it: Downgrade firmware abilitato:

source: Fix dlinkdns -> dlinkddns:
it: Correggi dlinkdns -> dlinkddns:

source: Main configuration file (XML):
it: File configurazione principale (XML):

source: CPE configuration file (XML) :
it: File configurazione CPE (XML) :

source: Router Info
it: Info router

source: Configuration loading status
it: Stato caricamento configurazione

source: Open configuration file (BIN format)
it: Apri file configurazione (formato BIN)

source: Open configuration file (XML format)
it: Apri file configurazione (formato XML)

source: Open CPE configuration file (XML format)
it: Apri file configurazione CPE (formato XML)

source: Save configuration file (BIN format)
it: Salva file configurazione (formato BIN)

source: Save configuration file (XML format)
it: Salva file configurazione (formato XML)

source: Save CPE configuration file (XML format)
it: Salva file configurazione CPE (formato XML)

source: Exit
it: Esci

source: Show passwords
it: Visualizza password

source: Show restricted commands
it: Visualizza comandi limitati

source: Save passwords
it: Salva password

source: Save restriced commands
it: Salva comandi limitati

source: Info about program
it: Info sul programma

source: Unlock restricted web GUI
it: Sblocca restrizioni interfaccia web

source: Unlock restricted CLI commands
it: Sblocca restrizioni comandi CLI

source: Enable firmware upgrade/downgrade
it: Abilita aggiornamento/downgrade firmware

source: Fix dlinkdns -> dlinkddns
it: Correggi dlinkdns -> dlinkddns

source: Settings
it: Impostazioni

source: Edit
it: Modifica

source: Available language:
it: Lingue disponibili:

source: Print debugging info
it: Stampa info debug

source: Use last used folder as load/save location
it: Usa ultima cartella selezionata per percorso operazioni apri/salva

source: Save/Load default folder
it: Cartella predefinita operazioni apri/salva

source: Preference file in program folder instead of user's folder
it: File impostazioni nella cartella programma invece di cartella utente

source: Default Language (restart needed after change)
it: Lingua predefinita (richiede riavvio programma dopo modifica)

source: Cancel
it: Annulla

source: Save
it: Salva

source: Removing user's preference file
it: Rimozione file impostazioni utente

source: Error removing
it: Errore rimozione

source: Removing preference file in program folder:
it: Rimozione file impostazioni dalla cartella

source: Folder name error
it: Errore nome cartella

source: Folder not available:
it: Cartella non disponibile:

source: ---- Passwords from main configuration file ----
it: ---- Password nel file di configurazione principale ----

source: ---- Main configuration file not loaded ----
it: ---- File di configurazione principale non caricato ----

source: ---- Passwords from CPE configuration file ----
it: ---- Password nel file di configurazione CPE ----

source: ---- CPE configuration file not loaded ----
it: ---- File di configurazione CPE non caricato ----

source: Text password file
it: File password testo

source: Choose a file
it: Scegli un file

source: Error writing
it: Errore scrittura

source: Preference file in program folder
it: File impostazioni nella cartella programma

source: not loaded
it: non caricato

source: Default language:
it: Lingua predefinità:

source: Usage: confxml2bin.py [ -l it|en ] <key4conf> <key4cpe> <conf_xml> <confcpe_xml> <conf_bin>
it: Uso: confxml2bin.py [ -l it|en ] <key4conf> <key4cpe> <conf_xml> <confcpe_xml> <conf_bin>

source: Usage: pkcrypt.py [ -l it|en ] sym_encrypt|sym_decrypt <key> <in> <out>
it: Uso: pkcrypt.py [ -l it|en ] sym_encrypt|sym_decrypt <key> <in> <out>

source: Error: first argument must be 'sym_encrypt' or 'sym_decrypt'.
it: Errore: il primo argomento deve essere 'sym_encrypt' or 'sym_decrypt'.

source: Operation not supported
it: Operazione non supportata
